toc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-22 Mon 18:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linear Algebra @BUCS</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="myStyle.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Linear Algebra @BUCS</h1>
<p>
This is a (draft) set of notes for <i>CAS CS 132: Geometric Algorithms</i>
at Boston University.  Admittedly, I was unsure if I wanted to take on
this project (in a sense, I still am).  I'm not convinced there's a
need for another collection of notes on linear algebra.  But it turns
out I can't help myself.  I am of the opinion that any good course
needs to be personal, so these are my personal notes, which follow
my way of thinking about and organizing the material.
</p>
<div id="outline-container-orgf01ae58" class="outline-2">
<h2 id="orgf01ae58">Table of Contents</h2>
<div class="outline-text-2" id="text-orgf01ae58">
</div>
<ul class="org-ul">
<li><a id="org112e699"></a><a href="Linear-Equations/notes.html">Linear Equations</a><br /></li>
<li><a id="org408966a"></a><a href="Matrices-Row-Ops/notes.html">Matrices and Row Operations</a><br /></li>
<li><a id="org60d34d4"></a>Gaussian Elimination<br /></li>
<li><a id="orga83790d"></a>An Aside: Numerics<br /></li>
<li><a id="org36f0b98"></a>Vector Equations<br /></li>
<li><a id="orgb20c8ce"></a>Matrix-Vector Equations<br /></li>
<li><a id="org0fb83d7"></a>Linear Independence<br /></li>
<li><a id="org0360d24"></a>Linear Transformations<br /></li>
<li><a id="org3aff837"></a>Matrices of Linear Transformations<br /></li>
<li><a id="org36b8d1c"></a>Matrix Algebra<br /></li>
<li><a id="orge52a4e5"></a>Matrix Inverses<br /></li>
<li><a id="org60daa1b"></a>Invertible Matrix Theorem<br /></li>
<li><a id="org6b02a37"></a>Algebraic Graph Theory<br /></li>
<li><a id="org90473fa"></a>Markov Chains<br /></li>
<li><a id="orgd9c2055"></a>The Decomposition<br /></li>
<li><a id="org87fafea"></a>Subspaces<br /></li>
<li><a id="org8df1f17"></a>Dimension and Rank<br /></li>
<li><a id="org3777c37"></a>Eigenvalues and Eigenvectors<br /></li>
<li><a id="org38d3f78"></a>The Characteristic Equation<br /></li>
<li><a id="orge957490"></a>Diagonalization<br /></li>
<li><a id="org9fd28d8"></a>Orthogonality<br /></li>
<li><a id="orga7e588b"></a>Least Squares<br /></li>
<li><a id="org84c62a4"></a>Advanced Topic: Linear Algebra and Machine Learning<br /></li>
</ul>
</div>
</div>
</body>
</html>
